[
    {
        "USEDT": "11:30:00",
        "SessionTitle": "Lunch",
        "SpeakerName": "",
        "Room": "Edison"
    },
    {
        "USEDT": "08:00:00",
        "SessionTitle": "The Power of Storytelling: Human Stories in a Digital World - Keynote",
        "SessionDescription":"As humans, we are hard-wired to respond to stories. In fact, stories may be one the most important tools we have to fight the isolation of modern life. Storytelling powers imagination persuasion, and motivation. It provides a path for meaningful growth and deep connection in our shared humanity. In this talk, I'll share the stories of how I've seen ordinary people like you and me use stories to create extraordinary outcomes in learning, innovation, and growth.",
        "SpeakerName": "Bekah",
        "Room": "Edison"
    },
    {
        "SessionTitle": "\"It's just simple JavaScript... and other Lies\"",
        "SessionDescription": "Do the junior and senior developers on your team speak the same language? Can you onboard a junior to your team right now? \r\n\r\nShopify isn’t exactly a small codebase to start your ‘learning journey’. How can you know what “simple JavaScript” is when you are trying to learn React, TypeScript, GraphQL, HTML, CSS, etc ... on the fly. \r\n\r\nJoin in for helpful examples to get the most out of your team, onboard junior developers at scale and maybe even teach the senior devs a thing or two :) ",
        "SpeakerName": "Taryn Musgrave",
        "Room": "Glenn 1-2",
        "USEDT": "09:00:00"
    },
    {
        "SessionTitle": "A11y with React Components.",
        "SessionDescription": "React is a tool. Used improperly it can be an inaccessible nightmare. Leveraged wisely it can give you the confidence that components are being implemented in an accessible way. During this talk, I will go through techniques and strategies to make your React Components more accessible.",
        "SpeakerName": "Russell Skaggs",
        "Room": "Morgan 2",
        "USEDT": "09:00:00"
    },
    {
        "SessionTitle": "Component Testing With Cypress",
        "SessionDescription": "Cypress released it's public beta back in October of 2017.   Not long after, it became the undisputed heavy weight champion of the automated testing world. It made end to end and integration testing actually effective, fast and fun! It had just one problem....Components. Thankfully with Cypress's 10.0 release of Component Testing, that problem no longer exists!  In this talk, you will learn how to get started with Cypress CT and some best practices to start writing component tests in your applications",
        "SpeakerName": "Jordan Powell",
        "Room": "Wright 2",
        "USEDT": "09:00:00"
    },
    {
        "SessionTitle": "Pay the Web Forward",
        "SessionDescription": "Trying to get paid on the Web today, as a creator, is broken and unfair. 70% of ad spend globally goes to only 2 platforms. Until recently, the Web couldn’t natively compete.\r\n\r\nA new W3C Standard proposal, Web Monetization, uses the Interledger Protocol to enable developers like you to make money from your work in an open, native, and seamless way. And all that with as little as a single line of HTML!\r\n\r\nIf you've ever wanted to know all about payments on the web or making money with your website, this talk is for you!",
        "SpeakerName": "Alex Lakatos",
        "Room": "Morgan 1",
        "USEDT": "09:00:00"
    },
    {
        "SessionTitle": "Performance is User Experience: optimizing the frontend for the users",
        "SessionDescription": "In most computer systems, definition of performance is straight forward enough: do more work per time with less resources. For a frontend web application, this is rarely the case. Frontend applications not only need to be resource-efficient, but must also \"feel\" efficient to the user. This makes performance on the frontend mostly a user experience issue. \r\n\r\nIn this presentation, the following questions will be answered: \r\n- What does performance mean? \r\n- What does it mean in the context of a frontend application? \r\n- Why is frontend performance a user experience issue? \r\n- What metrics should we look at when talking about performance in the frontend? \r\n- How do we measure them? \r\n- How do we optimize the frontend for the user? ",
        "SpeakerName": "Chinenye Onuegbu",
        "Room": "Morgan 3",
        "USEDT": "09:00:00"
    },
    {
        "SessionTitle": "Teaching Skills for Technical Experts",
        "SessionDescription": "Bad news: tech folks are not always the most compelling teachers.  (It's not our fault; we're used to teaching computers how to do things, not people!) Good news: teaching people is a learnable skill.  Best news: this talk is a quick primer on educational philosophy, curriculum development, and content delivery for technical experts.  We'll cover learning styles, effective communication, and audience management (aka how to “read the room”), along with an introduction to some free, web-based teaching resources.  Participants will leave ready to share their expertise with the world via more effective conference talks, workshops, and one-on-one mentoring.",
        "SpeakerName": "Tori Brenneison",
        "Room": "Wright 1",
        "USEDT": "09:00:00"
    },
    {
        "SessionTitle": "5 Lessons Learned from a Major Dependency Upgrade",
        "SessionDescription": "Upgrading dependencies can be a daunting experience. When dealing with numerous moving parts, diagnosing issues can demand a lot of patience. \r\n\r\nI recently had to upgrade a React Native app and learned some valuable lessons, which this talk aims to share.",
        "SpeakerName": "Ramón Huidobro",
        "Room": "Morgan 1",
        "USEDT": "10:15:00"
    },
    {
        "SessionTitle": "Artificial Intelligence & Race: Does AI have issues with racial bias?",
        "SessionDescription": "Note:\r\nThis is not a technical talk; however, the information delivered will give Programmers and Developers a subjective perception regarding the potential bias surrounding artificial intelligence and its awareness of racial indication.\r\n\r\nMy lecture/case study;  was based on sending the wrong man to prison for a crime he didn’t commit, using Facial Recognition software. \r\n\r\nI began to conduct research and submitted questionnaires and interviews throughout the technology community.  My findings lead me to this presentation.\r\n\r\nKey Takeaways:\r\n\r\n**Implement more training for developers to reduce overt acts of bias.\r\n\r\n**The future of facial recognition and ethnic partiality.\r\n\r\n**The Consequences of inaccurate data.\r\n\r\n**Public data vs. real-life data.\r\n\r\n**Adaptation for Facial Recognition to lessen the unintentional acts of preconceptions.\r\n\r\n**Distinctiveness intelligence to comprehend & resolve.\r\n\r\nThe proposal/lecture/case study; was based on sending the wrong man to prison for a crime he did not commit, using Facial Recognition software.  Some of the most prominent AI facial recognition is that these programs fail to recognize dark-skinned faces and dark skin in general, over fifty percent of the time.  50% is unacceptable and will only further systematic oppression and racism, plaguing people of color worldwide.\r\n\r\nFrom having our speed and traffic violations recorded at every stoplight via a computer-generated AI with facial recognition software to systems that immediately analyze a criminal’s fingerprints, it impacts us in many ways we do not even notice.  Artificial Intelligence is on our streets, in our grocery stores, and even in our homes.  It is an issue we need to address for various reasons, one of the most primary being some AI does not work if an individual is black.\r\n\r\nWe are not yet at a point wherein artificially intelligent robots are after human blood; this is good but does not mean it will ever occur.  While these AI processes may streamline many procedures and increase efficiency regarding certain aspects of modem society, the fact remains if it is used to make life-changing decisions for us, a disparity between appropriately recognizing the color of the subject’s skin is paramount and akin to further propagating the already vast racial disparities experienced around the world.\r\n\r\n•My research indicates that the latest facial recognition software is 99% effective if the subject is white but 80% or less effective when recognizing black faces, specifically black women.  My research found issues rooted within databases that provide a basis for facial recognition.\r\n\r\n•Until such a time that Artificial Intelligence is amended to include and recognize all races, it will remain a facet of institutionalized racism, which continues to threaten the livelihood of the global majority.",
        "SpeakerName": "Crux Conception, M. Psych",
        "Room": "Glenn 1-2",
        "USEDT": "10:15:00"
    },
    {
        "SessionTitle": "Azure DevOps for JavaScript Developers",
        "SessionDescription": "From pulling code from your repo to automating test runners and deploying code, Azure DevOps offers a lot of automation capabilities to assist in the building, testing, and delivery of JS apps. In this session, we will focus specifically on how Azure DevOps can deploy a React app to Azure, While this covers one framework, we will include resources for using Azure DevOps with other frameworks as well. By the end of this session, you should feel confident in using Azure DevOps to deploy your code.",
        "SpeakerName": "Sarah Dutkiewicz",
        "Room": "Morgan 3",
        "USEDT": "10:15:00"
    },
    {
        "SessionTitle": "Create an API with four lines of code",
        "SessionDescription": "APIs have made it easy for us to develop new tools and applications. Sometimes you want to perform small tasks, but there's no API for that. These APIs can be for internal use, or you might want to develop a quick prototype. Spending too much time writing numerous lines of JavaScript code to create that API isn't ideal.\r\nJoin me and learn how I created an API with just four lines of code and how you can too.",
        "SpeakerName": "Harshil Agrawal",
        "Room": "Morgan 2",
        "USEDT": "10:15:00"
    },
    {
        "SessionTitle": "An Overview of Client-Side Data Storage",
        "SessionDescription": "Every application needs data, but data can be a bottleneck for web applications both from a performance and offline capability standpoint. In this session, we'll examine how browsers enable websites to store data for your users. We'll look at multiple options, discuss when to use what, and a look at libraries that can make client-side data easier to use.",
        "SpeakerName": "Raymond Camden",
        "Room": "Morgan 1",
        "USEDT": "12:45:00"
    },
    {
        "SessionTitle": "Creating a modular UI component library",
        "SessionDescription": "Most organizations, from individual teams to whole enterprises, need standardized UI look and feel. UI component libraries allow quick development along with standardized UI/UX. However, implementing the brand vision and continuous refinement can be overwhelming if the architecture, both technically and organizationally, is not set correctly at first. \r\n\r\nModular programming is a software design technique that emphasizes separating the functionality of the program into independent, interchangeable modules. That allows quick pivoting and easy spin up of new software while allowing customization for individual product requirements. \r\n\r\nSeparation of responsibilities between product, engineering, and design empowers these individual groups to innovate or create solutions for future or current enhancements. \r\n\r\nCombining these ideas allow organizations of any size to create a UI component library and continuous refinement. \r\n\r\nYou’ll learn:\r\n\r\n•\tHow to identify areas of UI that can be modularized.\r\n•\tHow to layer different stacks of solutions to allow continuous development without dependency hell. \r\n•\tWhat the responsibilities are between product, engineering and design when it comes to a UI component library\r\n•\t Documentation of a newly created UI component library. \r\n",
        "SpeakerName": "Sean Lawrenz",
        "Room": "Morgan 2",
        "USEDT": "12:45:00"
    },
    {
        "SessionTitle": "Debugging JavaScript Applications",
        "SessionDescription": "Developers spend up to half their time debugging code, but often struggle to find an effective and efficient debugging process. With the right approach, debugging can actually be a fun learning experience that sheds light on underlying issues and areas of improvement in your codebase.\r\n\r\nThis talk will break down debugging as a process, including defining a bug, approaching the problem, how to use tools and collaboration effectively, and evaluating systemic reasons bugs happen. We'll also walk through some common types of bugs that occur in JavaScript applications to frame how you approach future issues.\r\n\r\nThis talk is helpful for beginners who don't know where to start with debugging, but also contains insights for intermediate-level developers that want to think more systematically about codebase quality.\r\n\r\nStatistic source: http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.444.9094&rep=rep1&type=pdf",
        "SpeakerName": "Cecelia Martinez",
        "Room": "Wright 1",
        "USEDT": "12:45:00"
    },
    {
        "SessionTitle": "Failing Successfully",
        "SessionDescription": "Failure is normal. It’s so normal that many software development teams encourage people to fail and fail fast. Failure is also scary. It makes us feel vulnerable. We may even worry that our jobs, relationships, or goals are on the line. Yet we hear countless stories of people turning failure into success in seemingly magical ways. This session will teach you what’s behind that magic. You’ll discover how to help yourself and others fail successfully. You’ll learn how to reflect on failures and apply those reflections in the future. Because success is hard to see in the midst of failure, we’ll also discuss techniques for surviving the challenging times. With this knowledge, you can use your failures as the building blocks of your own seemingly magical successes. ",
        "SpeakerName": "Cassandra Faris",
        "Room": "Glenn 1-2",
        "USEDT": "12:45:00"
    },
    {
        "SessionTitle": "Katas with a Programmer's Brain",
        "SessionDescription": "Let's explore what Katas are. How do they apply to programming? What can code katas do for a beginner developer, for an experienced developer? In this talk, we'll examine several code kata sites, code that can be generated as solutions, and how these solutions can help us improve our skill effectively over time.",
        "SpeakerName": "Bob Fornal",
        "Room": "Morgan 3",
        "USEDT": "12:45:00"
    },
    {
        "SessionTitle": "My tests passed, but why did my code fail?",
        "SessionDescription": "Writing testable code is important to the success of many software projects. Writing tests that adequately test the code is equally as important. Unfortunately, it is also often difficult to do.\r\n\r\nIn this language and framework agnostic session, we will discuss how to write comprehensive tests so that we won't have broken code even though all our tests pass. We will also talk about some best practices for writing tests and how to break your code up into smaller, more easily testable, chunks.",
        "SpeakerName": "Scott Stroz",
        "Room": "Wright 2",
        "USEDT": "12:45:00"
    },
    {
        "SessionTitle": "Coming to you live! Inclusive, effective, fun live streaming for Devs",
        "SessionDescription": "Adapting to having events online has been a learning experience for us all. How can we keep a constant, steady, interactive experience for our audience?\r\n\r\nIn this talk, we'll cover how we created Open Source Thursdays, including the tools we used, the accessibility considerations, as well as how we've improved it over time. Anyone can be a great live streamer!",
        "SpeakerName": "Ramón Huidobro",
        "Room": "Morgan 3",
        "USEDT": "14:00:00"
    },
    {
        "SessionTitle": "Get Respect: How to Get Buy In from the Business Side of Your Employer",
        "SessionDescription": "Ever feel like the non-devs and business suit side of your employer just ignore you? Do you think they don't take your suggestions or concerns seriously? This often leave developers frustrated and sidelined by management. The gap between dev and business is often large but can be bridged through thoughtful strategies. Not only will you learn from this session how business analysis, product owners, and the executive suite think, but how to be heard, influence their decisions, and most importantly get respect.",
        "SpeakerName": "Brian Boyer",
        "Room": "Wright 2",
        "USEDT": "14:00:00"
    },
    {
        "SessionTitle": "Goodbye Dockerfiles: Build Secure & Optimised Node.js Container Images with Cloud Native Buildpacks.",
        "SessionDescription": "Buildpacks were first conceived by Heroku in 2011. Since then, they have been adopted by Cloud Foundry and other PaaS such as Google App Engine, Gitlab, Knative, Deis, Dokku, and Drie, and joined the  Cloud Native Computing Foundation in October 2018.\r\n\r\nCloud Native Buildpacks transform your application source code into images that can run on any cloud.\r\nSo we can have a balanced control between App Devs and Operators so we can guarantee apps meet security and compliance requirements and eventully perform upgrades with minimal effort and intervention.\r\n\r\nIn this talk we will explore how lifecycle - the binary at the heart of buildpacks - makes all this possible.",
        "SpeakerName": "Alejandro Mercado",
        "Room": "Morgan 2",
        "USEDT": "14:00:00"
    },
    {
        "SessionTitle": "Making A Strong Case For Accessibility",
        "SessionDescription": "Accessibility is often overlooked or bolted on to the end of a project from the experiences in my career in web development and design. The case for accessibility is something we as people who create and build things for the web should be implementing and advocating for from the inception of a project to the release or handoff and beyond. ",
        "SpeakerName": "Todd Libby",
        "Room": "Glenn 1-2",
        "USEDT": "14:00:00"
    },
    {
        "SessionTitle": "Node.js Multithreading",
        "SessionDescription": "Node.js's sweet spot has traditionally been with I/O-intensive processes. It's event-driven architecture allows I/O operations to run concurrently while their associated callbacks are executed synchronously in the event loop. This, however, comes with a dark side in that CPU-bound operations are likely to block the event loop thus delaying when those callbacks are invoked. Fortunately, Node.js ships with several modules that allow us to offload those blocking CPU-bound operations from the main event loop so it's free to handle other tasks while the CPU-bound operations go about their business. Most notably we'll explore some ways in which the child_process and worker_threads modules can keep your Node.js application performant while still handling those CPU-intensive operations.",
        "SpeakerName": "Dave Fancher",
        "Room": "Wright 1",
        "USEDT": "14:00:00"
    },
    {
        "SessionTitle": "Dark UX Patterns",
        "SessionDescription": "Congratulations! You are the 1,000,000th visitor to our website. Click here to redeem your prize! Just provide your date of birth and phone number to get started.\r\n\r\nLearn about Dark UX Patterns, how they work, how they trick you and what companies are the worst offenders. Roach Motel, Privacy Zuckering? Let’s visit Dark Patterns Hall of Shame and see who joined the dark side!\r\n\r\nThis talk will break down the most popular dark patterns using real life examples from websites and apps you use every day. If you are a designer, a developer or a product manager, you will learn what to avoid when building your product and how to integrate digital well-being and safety features into your service. If you are an end user, we will teach you how to respond to dark patterns in order to stay safe online, protect your privacy, save your money and keep your sanity.",
        "SpeakerName": "Vitaliy Matiyash",
        "Room": "Wright 1",
        "USEDT": "15:15:00"
    },
    {
        "SessionTitle": "IoT, JavaScript and Beer Brewing: Cheers to that!",
        "SessionDescription": "Beer brewing can be fun, but combining brewing with IoT device hacking is even more fun. It is possible to connect and collect data about almost anything, including the fermentation process inside a closed fermenter using open source technologies. In this presentation, the speaker will introduce basic concepts of IoT devices, how to collect the data efficiently and how to use various tools to store, extract and manipulate that data. And if you’re new to beer brewing, don’t worry; you will also learn a thing or two about that as well!",
        "SpeakerName": "Joel Lord",
        "Room": "Morgan 3",
        "USEDT": "15:15:00"
    },
    {
        "SessionTitle": "The Spy of Testadel: a unit-testing medieval tale",
        "SessionDescription": "When people get started with unit testing, they often get stumped when it comes to testing functions that have side effects. This talk is a gentle introduction to some of the concepts involved in testing side effects. \r\n\r\nThe year is 1452. An uneasy truce between the kingdom of Testadel and the fiefdom of its neighbour, Sir SideEffects, is on the verge of collapse. Follow along as our hero, a court jester aptly named Jest, infiltrates the enemy's camp to gather information, and uncover Sir SideEffects' treachery.\r\n\r\nThrough the clever - I think - use of an allegory, this talk will answer:\r\n- What is the difference between a pure function and a function with side-effects. \r\n- Why testing functions with side-effects is usually harder. \r\n- What strategies can be employed to test functions with side-effects, and their tradeoffs. \r\n- What are spies and how to use them.\r\n- What libraries can help with testing side-effects.",
        "SpeakerName": "Philippe Vaillancourt",
        "Room": "Morgan 1",
        "USEDT": "15:15:00"
    },
    {
        "SessionTitle": "Want to try public speaking? You totally should! Here's how.",
        "SessionDescription": "Yes, public speaking can be incredibly intimidating. Yes, it takes a tremendous amount of work to prepare a great talk.  But most importantly: it is absolutely worth it.\r\n\r\nPublic speaking can have incredible benefits for both learning and career opportunities. It is also a fantastic way to give back to the community.\r\n\r\nWhile public speaking offers unique challenges for each speaker, many speakers encounter the same difficulties in the beginning.\r\n\r\nI'll cover tips on how to get started, how to submit a talk to a conference, how to prepare a talk, and how to encourage others to speak!",
        "SpeakerName": "Michael Richardson",
        "Room": "Morgan 2",
        "USEDT": "15:15:00"
    },   
    {
        "USEDT": "16:30:00",
        "SessionTitle": "Closing and GiveAway",
        "SpeakerName": "JavaScript and Friends",
        "Room": "Edison"
    }
]